{
    "displayName": "CA011: Require Password Change \u2014 Medium-Risk Users",
    "state": "enabledForReportingButNotEnforced",
    "conditions": {
        "users": {
            "includeUsers": [
                "All"
            ],
            "excludeGroups": [
                "xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx"
            ]
        },
        "applications": {
            "includeApplications": [
                "All"
            ]
        },
        "userRiskLevels": [
            "medium"
        ],
        "clientAppTypes": [
            "all"
        ]
    },
    "grantControls": {
        "operator": "AND",
        "builtInControls": [
            "mfa",
            "passwordChange"
        ]
    }
}
